kslabs/BMI30.stm32h7/USB_DEVICE/App/usbd_cdc_custom.c
static uint8_t USBD_CDCVND_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
  USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData;
  if (!hcdc) return (uint8_t)USBD_FAIL;
  uint16_t status_info = 0; uint16_t len;
  /* ДОБАВЛЕНО: ветка обработки vendor-specific control (GET_STATUS / GET_LCD_STATUS / SOFT/DEEP RESET) */
  if ( (req->bmRequest & USB_REQ_TYPE_MASK) == USB_REQ_TYPE_VENDOR ) {
    VND_LOGF("[SETUP:VND] bm=0x%02X bReq=0x%02X wIndex=%u wLength=%u", (unsigned)req->bmRequest, (unsigned)req->bRequest, (unsigned)req->wIndex, (unsigned)req->wLength);
    /* Принимаем IN GET_STATUS вне зависимости от получателя и номера интерфейса (wIndex),
       чтобы упростить жизнь хостам, где CTRL к Interface может быть ограничен. */
    if ( (req->bmRequest & 0x80U) && req->bRequest == VND_CMD_GET_STATUS ) {
      uint8_t buf[VND_STATUS_MAX];
      uint16_t max_len = (req->wLength != 0U && req->wLength < (uint16_t)sizeof(buf))
                       ? req->wLength
                       : (uint16_t)sizeof(buf);
      uint16_t l = vnd_build_status(buf, max_len);
      if(!l){ USBD_CtlError(pdev, req); return (uint8_t)USBD_FAIL; }
      VND_LOGF("[SETUP:VND] -> STAT %uB", (unsigned)l);
      USBD_CtlSendData(pdev, buf, l);
      return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) && req->bRequest == VND_CMD_GET_LCD_STATUS ) {
      uint8_t buf[VND_LCD_STATUS_MAX];
      uint16_t max_len = (req->wLength != 0U && req->wLength < (uint16_t)sizeof(buf))
                       ? req->wLength
                       : (uint16_t)sizeof(buf);
      uint16_t l = vnd_build_lcd_status(buf, max_len);
      if(!l){ USBD_CtlError(pdev, req); return (uint8_t)USBD_FAIL; }
      VND_LOGF("[SETUP:VND] -> LCDS %uB", (unsigned)l);
      USBD_CtlSendData(pdev, buf, l);
      return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) && req->bRequest == VND_CMD_GET_DC_CONFIG ) {
      uint8_t buf[VND_DC_CONFIG_MAX];
      uint16_t max_len = (req->wLength != 0U && req->wLength < (uint16_t)sizeof(buf))
                       ? req->wLength
                       : (uint16_t)sizeof(buf);
      uint16_t l = vnd_build_dc_config(buf, max_len);
      if(!l){ USBD_CtlError(pdev, req); return (uint8_t)USBD_FAIL; }
      VND_LOGF("[SETUP:VND] -> DCCF %uB", (unsigned)l);
      USBD_CtlSendData(pdev, buf, l);
      return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) == 0 && req->wLength == 0 && req->bRequest == 0x7Eu ) {
      /* SOFT_RESET: мгновенно подтверждаем статусом и выполняем ресет в фоне */
      g_req_soft_reset = 1; USBD_CtlSendStatus(pdev); return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) == 0 && req->wLength == 0 && req->bRequest == 0x7Fu ) {
      /* DEEP_RESET: то же, но с переоткрытием EP */
      g_req_deep_reset = 1; USBD_CtlSendStatus(pdev); return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) == 0 && req->wLength == 0 &&
                (req->bRequest == VND_CMD_START_STREAM || req->bRequest == VND_CMD_STOP_STREAM) ) {
      /* Разрешаем START/STOP по control OUT без данных: эмулируем приём команды Vendor */
      uint8_t cmd = (uint8_t)req->bRequest;
      USBD_VND_DataReceived(&cmd, 1U);
      USBD_CtlSendStatus(pdev);
      return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) == 0 && req->wLength == 0 &&
                (req->bRequest == VND_CMD_SET_ASYNC_MODE || req->bRequest == VND_CMD_SET_CHMODE ||
                 req->bRequest == VND_CMD_SET_FULL_MODE  || req->bRequest == VND_CMD_SET_PROFILE ||
                 req->bRequest == VND_CMD_SET_TX_ENABLE || req->bRequest == VND_CMD_SET_OPTIC_POWER ||
                 req->bRequest == VND_CMD_SET_LED_PATTERN || req->bRequest == VND_CMD_SET_DET_ADC) ) {
      /* Альтернативный путь: принять параметр через wValue (без data stage) */
      uint8_t tmp[2];
      tmp[0] = (uint8_t)req->bRequest;
      tmp[1] = (uint8_t)(req->wValue & 0xFFU);
      USBD_VND_DataReceived(tmp, 2U);
      USBD_CtlSendStatus(pdev);
      return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) == 0 && req->wLength == 0 &&
                (req->bRequest == VND_CMD_SET_OPTIC_HOLD) ) {
      /* SET_OPTIC_HOLD: 16-bit deciseconds in wValue (0=default 3.0s). */
      uint8_t tmp[3];
      tmp[0] = (uint8_t)req->bRequest;
      tmp[1] = (uint8_t)(req->wValue & 0xFFU);
      tmp[2] = (uint8_t)((req->wValue >> 8) & 0xFFU);
      USBD_VND_DataReceived(tmp, 3U);
      USBD_CtlSendStatus(pdev);
      return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) == 0 && req->wLength == 0 &&
                (req->bRequest == VND_CMD_SET_FRAME_SAMPLES) ) {
      /* SET_FRAME_SAMPLES: 16-битное значение в wValue (LSB first) */
      uint8_t tmp[3];
      tmp[0] = (uint8_t)req->bRequest;
      tmp[1] = (uint8_t)(req->wValue & 0xFFU);
      tmp[2] = (uint8_t)((req->wValue >> 8) & 0xFFU);
      USBD_VND_DataReceived(tmp, 3U);
      USBD_CtlSendStatus(pdev);
      return (uint8_t)USBD_OK;
    } else if ( (req->bmRequest & 0x80U) == 0 && req->wLength > 0 &&
                (req->bRequest == VND_CMD_SET_ASYNC_MODE || req->bRequest == VND_CMD_SET_CHMODE ||
                 req->bRequest == VND_CMD_SET_FULL_MODE  || req->bRequest == VND_CMD_SET_PROFILE ||
                 req->bRequest == VND_CMD_SET_TX_ENABLE || req->bRequest == VND_CMD_SET_OPTIC_POWER ||
                 req->bRequest == VND_CMD_SET_OPTIC_HOLD || req->bRequest == VND_CMD_SET_LED_PATTERN ||
                 req->bRequest == VND_CMD_SET_DET_ADC || req->bRequest == VND_CMD_SET_DC_CONFIG) ) {
      /* Принимаем небольшие конфиги по control OUT с телом данных, доставляем в Vendor как будто по Bulk OUT */
      hcdc->CmdOpCode = req->bRequest;
      hcdc->CmdLength = (uint8_t)req->wLength;
      USBD_CtlPrepareRx(pdev, (uint8_t*)hcdc->data, req->wLength); // cast
      return (uint8_t)USBD_OK;
    } else {
      VND_LOGF("[SETUP:VND] unsupported -> STALL");
      USBD_CtlError(pdev, req);
      return (uint8_t)USBD_FAIL;
    }
  }
  switch (req->bmRequest & USB_REQ_TYPE_MASK) {
    case USB_REQ_TYPE_CLASS:
      if (req->wLength != 0U) {
        if (req->bmRequest & 0x80U) {
          if (CDC_USR(pdev)) CDC_USR(pdev)->Control(req->bRequest, (uint8_t*)hcdc->data, req->wLength); // cast
          len = (uint16_t)MIN(CDC_REQ_MAX_DATA_SIZE, req->wLength);
          USBD_CtlSendData(pdev, (uint8_t*)hcdc->data, len); // cast
        } else {
          hcdc->CmdOpCode = req->bRequest; hcdc->CmdLength = (uint8_t)req->wLength;
          USBD_CtlPrepareRx(pdev, (uint8_t*)hcdc->data, req->wLength); // cast
        }
      } else {
        if (CDC_USR(pdev)) CDC_USR(pdev)->Control(req->bRequest, (uint8_t*)req, 0U);
      }
      break;
    case USB_REQ_TYPE_STANDARD:
      switch (req->bRequest) {
        case USB_REQ_GET_STATUS:
          if (pdev->dev_state == USBD_STATE_CONFIGURED) USBD_CtlSendData(pdev, (uint8_t*)&status_info, 2U); else { USBD_CtlError(pdev, req); return (uint8_t)USBD_FAIL; }
          break;
        case USB_REQ_GET_INTERFACE:
          if (pdev->dev_state == USBD_STATE_CONFIGURED) {
            uint8_t cur = 0;
            if (req->wIndex == 2) cur = (uint8_t)g_alt_if2; /* наш Vendor IF */
            /* CDC интерфейсы IF0/IF1 всегда alt0 */
            USBD_CtlSendData(pdev, &cur, 1U);
          } else { USBD_CtlError(pdev, req); return (uint8_t)USBD_FAIL; }
          break;
        case USB_REQ_SET_INTERFACE:
          if (pdev->dev_state != USBD_STATE_CONFIGURED) { USBD_CtlError(pdev, req); return (uint8_t)USBD_FAIL; }
          /* Поддержка altsetting для IF#2: 0 -> idle (закрыть EP), 1 -> stream (открыть EP) */
          if (req->wIndex == 2) {
            uint16_t alt = req->wValue;
            if (alt == 0) {
              /* Остановить пайплайн приложения и закрыть EP */
              printf("[USB_IF2] SET_INTERFACE alt=0 (CLOSE)\r\n");
              vnd_log_usb_close_snapshot("set_interface_alt0");
              vnd_pipeline_stop_reset(0);
              (void)USBD_LL_CloseEP(pdev, VND_IN_EP);  pdev->ep_in[VND_IN_EP & 0x0FU].is_used = 0U;
              (void)USBD_LL_CloseEP(pdev, VND_OUT_EP); pdev->ep_out[VND_OUT_EP & 0x0FU].is_used = 0U;
              g_alt_if2 = 0;
            } else if (alt == 1) {
              /* Открыть EP и реармить приём */
              printf("[USB_IF2] SET_INTERFACE alt=1 (OPEN) speed=%s\r\n", 
                     pdev->dev_speed == USBD_SPEED_HIGH ? "HS" : "FS");
              if (pdev->dev_speed == USBD_SPEED_HIGH) {
                (void)USBD_LL_OpenEP(pdev, VND_IN_EP,  USBD_EP_TYPE_BULK, VND_DATA_HS_MAX_PACKET_SIZE);
                pdev->ep_in[VND_IN_EP & 0x0FU].is_used = 1U;
                (void)USBD_LL_OpenEP(pdev, VND_OUT_EP, USBD_EP_TYPE_BULK, VND_DATA_HS_MAX_PACKET_SIZE);
                pdev->ep_out[VND_OUT_EP & 0x0FU].is_used = 1U;
                (void)USBD_LL_PrepareReceive(pdev, VND_OUT_EP, vnd_rx_buf, VND_DATA_HS_MAX_PACKET_SIZE);
              } else {
                (void)USBD_LL_OpenEP(pdev, VND_IN_EP,  USBD_EP_TYPE_BULK, VND_DATA_FS_MAX_PACKET_SIZE);
                pdev->ep_in[VND_IN_EP & 0x0FU].is_used = 1U;
                (void)USBD_LL_OpenEP(pdev, VND_OUT_EP, USBD_EP_TYPE_BULK, VND_DATA_FS_MAX_PACKET_SIZE);
                pdev->ep_out[VND_OUT_EP & 0x0FU].is_used = 1U;
                (void)USBD_LL_PrepareReceive(pdev, VND_OUT_EP, vnd_rx_buf, VND_DATA_FS_MAX_PACKET_SIZE);
              }
              g_alt_if2 = 1;
              extern volatile uint32_t vnd_stage_alt1_ms; /* объявлено в usb_vendor_app.c */
              if(vnd_stage_alt1_ms == 0){ vnd_stage_alt1_ms = HAL_GetTick(); }
              printf("[USB_IF2] EP#3 and EP#83 opened, receiving enabled\r\n");
            }
            USBD_CtlSendStatus(pdev);
            /* Выполним возможные отложенные сервисы */
            USBD_VND_ProcessControlRequests();
            return (uint8_t)USBD_OK;
          }
          /* Иные интерфейсы (CDC IF0/IF1) — поддерживают только alt=0. Подтверждаем статусом без действий. */
          USBD_CtlSendStatus(pdev);
          return (uint8_t)USBD_OK;
        default: USBD_CtlError(pdev, req); return (uint8_t)USBD_FAIL;
      }
      break;
    default: USBD_CtlError(pdev, req); return (uint8_t)USBD_FAIL;
  }
  return (uint8_t)USBD_OK;
}

static uint8_t USBD_CDCVND_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData;
  if (!hcdc) return (uint8_t)USBD_FAIL;
  PCD_HandleTypeDef *hpcd = (PCD_HandleTypeDef*)pdev->pData;
  if ((CDC_IN_EP & 0x7FU) == epnum) {
    if ((pdev->ep_in[epnum].total_length > 0U) && ((pdev->ep_in[epnum].total_length % hpcd->IN_ep[epnum].maxpacket) == 0U)) {
      pdev->ep_in[epnum].total_length = 0U;
      (void)USBD_LL_Transmit(pdev, epnum, NULL, 0U); /* ZLP */
    } else {
      hcdc->TxState = 0U;
      if (CDC_USR(pdev) && CDC_USR(pdev)->TransmitCplt) CDC_USR(pdev)->TransmitCplt(hcdc->TxBuffer, &hcdc->TxLength, epnum);
    }
  } else if ((VND_IN_EP & 0x7FU) == epnum) {
    /* Vendor Bulk IN: CDC-подобная схема завершения.
       Если длина передачи кратна размеру пакета (MPS), требуется отправить ZLP,
       иначе некоторые хосты (Windows/libusb FS) будут ждать продолжения и в итоге
       получать таймаут. Поведение аналогично CDC. */
    uint16_t tl = pdev->ep_in[epnum].total_length;
    uint16_t mps = hpcd->IN_ep[epnum].maxpacket;
    uint8_t was_busy = vnd_tx_busy;
    uint8_t active_slot = vnd_tx_active_slot;
    vnd_dataIn_counter++;
    VND_LOGF("[VND_DataIn:ENTER] ep=%u tl=%u mps=%u busy=%u cnt=%lu\r\n", (unsigned)epnum, (unsigned)tl,(unsigned)mps,(unsigned)vnd_tx_busy,(unsigned long)vnd_dataIn_counter);
    if (!was_busy && active_slot == 0xFFu) {
      pdev->ep_in[epnum].total_length = 0U;
      VND_LOGF("[VND_DataIn] stale callback ignored ep=%u cnt=%lu\r\n", (unsigned)epnum, (unsigned long)vnd_dataIn_counter);
      return (uint8_t)USBD_OK;
    }
    if (mps == 0U) {
      pdev->ep_in[epnum].total_length = 0U;
      vnd_tx_busy = 0U;
      vnd_tx_active_slot = 0xFFu;
      USBD_VND_TxCplt();
      return (uint8_t)USBD_OK;
    }
    if ((tl > 0U) && ((tl % mps) == 0U)) {
      /* Нужен ZLP для корректного завершения трансфера */
      VND_LOGF("[VND_DataIn] ep=%u total=%u -> SEND ZLP (phase1) cnt=%lu\r\n", (unsigned)epnum, (unsigned)tl, (unsigned long)vnd_dataIn_counter);
      pdev->ep_in[epnum].total_length = 0U;
      (void)USBD_LL_Transmit(pdev, epnum, NULL, 0U); /* ZLP */
      /* НЕ вызываем TxCplt здесь — он будет вызван при следующем DataIn после ZLP */
    } else {
      /* Обычное завершение (либо tl=0 после ZLP, либо tl не кратно mps) */
      VND_LOGF("[VND_DataIn] ep=%u total=%u -> COMPLETE (TxCplt) cnt=%lu\r\n", (unsigned)epnum, (unsigned)tl, (unsigned long)vnd_dataIn_counter);
      pdev->ep_in[epnum].total_length = 0U; /* очистить остаток для надёжности */
      vnd_tx_busy = 0U;
      vnd_tx_active_slot = 0xFFu;
      USBD_VND_TxCplt();
    }
  }
  return (uint8_t)USBD_OK;
}

static uint8_t USBD_CDCVND_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData;
  if (!hcdc) return (uint8_t)USBD_FAIL;
  if (epnum == (CDC_OUT_EP & 0x7FU)) {
    hcdc->RxLength = USBD_LL_GetRxDataSize(pdev, epnum);
    if (CDC_USR(pdev) && CDC_USR(pdev)->Receive) CDC_USR(pdev)->Receive(hcdc->RxBuffer, &hcdc->RxLength);
  } else if (epnum == (VND_OUT_EP & 0x7FU)) {
    vnd_rx_len = USBD_LL_GetRxDataSize(pdev, epnum);
    /* D-Cache (STM32H7): инвалидировать диапазон RX перед чтением, иначе возможны "старые" данные */
#if defined (SCB_InvalidateDCache_by_Addr)
    if (vnd_rx_len > 0) {
      uintptr_t addr = (uintptr_t)vnd_rx_buf;
      uint32_t inv_addr = (uint32_t)(addr & ~((uintptr_t)31U));
      uint32_t inv_len  = (uint32_t)(((addr + vnd_rx_len + 31U) & ~((uintptr_t)31U)) - inv_addr);
      SCB_InvalidateDCache_by_Addr((uint32_t*)inv_addr, (int32_t)inv_len);
    }
#endif
    USBD_VND_DataReceived(vnd_rx_buf, vnd_rx_len);
    /* Небольшой memory barrier для надёжности перед реармом приёма */
    {
      USB_OTG_GlobalTypeDef *usb_reg = (USB_OTG_GlobalTypeDef *)USB1_OTG_HS_PERIPH_BASE;
      (void)usb_reg->GINTSTS; /* volatile read */
    }
    /* Реармим */
    if (pdev->dev_speed == USBD_SPEED_HIGH)
      (void)USBD_LL_PrepareReceive(pdev, VND_OUT_EP, vnd_rx_buf, VND_DATA_HS_MAX_PACKET_SIZE);
    else
      (void)USBD_LL_PrepareReceive(pdev, VND_OUT_EP, vnd_rx_buf, VND_DATA_FS_MAX_PACKET_SIZE);
  }
  return (uint8_t)USBD_OK;
}

static uint8_t USBD_CDCVND_EP0_RxReady(USBD_HandleTypeDef *pdev)
{
  USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData;
  if (!hcdc) return (uint8_t)USBD_FAIL;
  if (hcdc->CmdOpCode != 0xFFU) {
    uint8_t op = hcdc->CmdOpCode;
    uint8_t len = hcdc->CmdLength;
    /* Если это один из наших vendor control OUT запросов с полезной нагрузкой —
       формируем буфер [opcode | payload] и передаём в общий обработчик Vendor. */
    if (op == VND_CMD_SET_ASYNC_MODE ||
        op == VND_CMD_SET_CHMODE    ||
        op == VND_CMD_SET_FULL_MODE ||
        op == VND_CMD_SET_PROFILE   ||
        op == VND_CMD_SET_TX_ENABLE ||
        op == VND_CMD_SET_OPTIC_POWER ||
        op == VND_CMD_SET_OPTIC_HOLD ||
        op == VND_CMD_SET_LED_PATTERN ||
        op == VND_CMD_SET_DET_ADC ||
        op == VND_CMD_SET_DC_CONFIG) {
      uint32_t tot = (uint32_t)len + 1U;
      if (tot > sizeof(vnd_rx_buf)) tot = sizeof(vnd_rx_buf); /* страхуемся от выхода за границы */
      vnd_rx_buf[0] = op;
      if (tot > 1U) {
        memcpy(&vnd_rx_buf[1], (uint8_t*)hcdc->data, (size_t)(tot - 1U)); // cast
      }
      USBD_VND_DataReceived(vnd_rx_buf, tot);
    } else {
      /* Иначе — это обычная CDC class команда */
      if (CDC_USR(pdev) && CDC_USR(pdev)->Control) {
        CDC_USR(pdev)->Control(op, (uint8_t*)hcdc->data, len); // cast
      }
    }
    hcdc->CmdOpCode = 0xFFU;
  }
  return (uint8_t)USBD_OK;
}

static uint8_t *USBD_CDCVND_GetFSCfgDesc(uint16_t *length) { *length = sizeof(USBD_CDCVND_CfgFSDesc); return USBD_CDCVND_CfgFSDesc; }
static uint8_t *USBD_CDCVND_GetHSCfgDesc(uint16_t *length) { *length = sizeof(USBD_CDCVND_CfgHSDesc); return USBD_CDCVND_CfgHSDesc; }
static uint8_t *USBD_CDCVND_GetOtherSpeedCfgDesc(uint16_t *length) { *length = sizeof(USBD_CDCVND_OtherSpeedCfgDesc); return USBD_CDCVND_OtherSpeedCfgDesc; }
static uint8_t *USBD_CDCVND_GetDeviceQualifierDescriptor(uint16_t *length) { *length = USB_LEN_DEV_QUALIFIER_DESC; return USBD_CDCVND_DeviceQualifierDesc; }

/* Конец файла */
